//=============================================================================
//
// ファイルクラス [file.cpp]
// Author:KUDO AYANO
//
//=============================================================================
#include "file.h"
#include "object.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define FAIL_NAME "data/Txt/stage.txt"      // 使用するファイルの名前

//=============================================================================
// [CFile] コンストラクタ
//=============================================================================
CFile::CFile()
{

}

//=============================================================================
// [~CFile] デストラクタ
//=============================================================================
CFile::~CFile()
{

}

//=============================================================================
// [Read] ファイルの読み込み
//=============================================================================
void CFile::Read(void)
{
}

//=============================================================================
// [Writing] ファイルの書き込み
//=============================================================================
void CFile::Writing(void)
{
    // 変数宣言
    FILE *pFile = fopen(FAIL_NAME, "w");

    if (pFile)
    {// ファイル書き込み
        fprintf(pFile, "SCRIPT          // スクリプト開始 \n\n");       // スクリプト開始

        // オブジェクトの数分データを書きだす
        for (int nCntObjct = 0; nCntObjct < MAX_OBJECT; nCntObjct++)
        {
            CModel *pScene = CObject::GetObjectData(nCntObjct);
            if (pScene)
            {// オブジェクトがあった場合
                D3DXVECTOR3 pos = pScene->GetPos();
                fprintf(pFile, "\tOBJ_SET\n");
                fprintf(pFile, "\t\t POS %.1f %.1f %.1f \n", pos.x,pos.y,pos.z);
                fprintf(pFile, "\tEND_OBJ_SET\n");
                fprintf(pFile, "\n");
            }
        }
        fprintf(pFile, "\n");
        fprintf(pFile, "END_SCRIPT      // スクリプト終了");   // スクリプト終了
        fclose(pFile);                  // ファイル書き込み終了
    }

}
